load-test/k6/results/test-3-for-2-min-ingestion-20-vus/insert-app_csharp_2.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\ 
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 2m0s (gracefulStop: 30s)


     _csharp_2......................: avg=5.003884 min=1.385  med=4.484  max=154.204  p(90)=7.592  p(95)=8.964
     data_received..................: 97 MB  805 kB/s
     data_sent......................: 88 MB  733 kB/s
     http_req_blocked...............: avg=2.94µs   min=1µs    med=2µs    max=2.21ms   p(90)=3µs    p(95)=4µs
     http_req_connecting............: avg=285ns    min=0s     med=0s     max=884µs    p(90)=0s     p(95)=0s
     http_req_duration..............: avg=5.08ms   min=1.42ms med=4.56ms max=154.26ms p(90)=7.68ms p(95)=9.05ms
       { expected_response:true }...: avg=5.08ms   min=1.42ms med=4.56ms max=154.26ms p(90)=7.68ms p(95)=9.05ms
     http_req_failed................: 0.00%  ✓ 0           ✗ 455619
     http_req_receiving.............: avg=68.49µs  min=12µs   med=32µs   max=23.76ms  p(90)=68µs   p(95)=224µs
     http_req_sending...............: avg=15.6µs   min=5µs    med=14µs   max=3.85ms   p(90)=21µs   p(95)=25µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s       p(90)=0s     p(95)=0s
     http_req_waiting...............: avg=5ms      min=1.38ms med=4.48ms max=154.2ms  p(90)=7.59ms p(95)=8.96ms
     http_reqs......................: 455619 3796.782476/s
     iteration_duration.............: avg=5.25ms   min=1.56ms med=4.73ms max=154.43ms p(90)=7.86ms p(95)=9.23ms
     iterations.....................: 455619 3796.782476/s
     vus............................: 20     min=20        max=20
     vus_max........................: 20     min=20        max=20


running (2m00.0s), 00/20 VUs, 455619 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  2m0s